src/logs/api/test-api-prediction-bets-20250730-165444.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/api/test-api-prediction-bets.ts
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 30 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 30 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  01.0s/30s

running (0m02.0s), 30/30 VUs, 90 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  02.0s/30s

running (0m03.0s), 30/30 VUs, 150 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  03.0s/30s

running (0m04.0s), 30/30 VUs, 205 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  04.0s/30s

running (0m05.0s), 30/30 VUs, 265 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  05.0s/30s

running (0m06.0s), 30/30 VUs, 322 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  06.0s/30s

running (0m07.0s), 30/30 VUs, 382 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  07.0s/30s

running (0m08.0s), 30/30 VUs, 436 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  08.0s/30s

running (0m09.0s), 30/30 VUs, 496 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  09.0s/30s

running (0m10.0s), 30/30 VUs, 556 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  10.0s/30s

running (0m11.0s), 30/30 VUs, 615 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  11.0s/30s

running (0m12.0s), 30/30 VUs, 670 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  12.0s/30s

running (0m13.0s), 30/30 VUs, 728 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  13.0s/30s

running (0m14.0s), 30/30 VUs, 777 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  14.0s/30s

running (0m15.0s), 30/30 VUs, 837 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  15.0s/30s

running (0m16.0s), 30/30 VUs, 891 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  16.0s/30s

running (0m17.0s), 30/30 VUs, 951 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  17.0s/30s

running (0m18.0s), 30/30 VUs, 1007 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  18.0s/30s

running (0m19.0s), 30/30 VUs, 1066 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  19.0s/30s

running (0m20.0s), 30/30 VUs, 1124 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  20.0s/30s

running (0m21.0s), 30/30 VUs, 1180 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  21.0s/30s

running (0m22.0s), 30/30 VUs, 1239 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  22.0s/30s

running (0m23.0s), 30/30 VUs, 1299 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  23.0s/30s

running (0m24.0s), 30/30 VUs, 1352 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  24.0s/30s

running (0m25.0s), 30/30 VUs, 1411 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  25.0s/30s

running (0m26.0s), 30/30 VUs, 1471 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  26.0s/30s

running (0m27.0s), 30/30 VUs, 1531 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  27.0s/30s

running (0m28.0s), 30/30 VUs, 1589 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  28.0s/30s

running (0m29.0s), 30/30 VUs, 1644 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  29.0s/30s

running (0m30.0s), 30/30 VUs, 1704 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  30.0s/30s


  █ TOTAL RESULTS 

    checks_total.......................: 1734    56.9062/s
    checks_succeeded...................: 100.00% 1734 out of 1734
    checks_failed......................: 0.00%   0 out of 1734

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=18.35ms  min=5ms      med=10ms     max=250.8ms  p(90)=42.84ms  p(95)=68.33ms 
      { expected_response:true }............................................: avg=18.35ms  min=5ms      med=10ms     max=250.8ms  p(90)=42.84ms  p(95)=68.33ms 
    http_req_failed.........................................................: 0.00%  0 out of 1734
    http_reqs...............................................................: 1734   56.9062/s

    EXECUTION
    iteration_duration......................................................: avg=523.75ms min=506.26ms med=511.05ms max=815.66ms p(90)=554.26ms p(95)=588.68ms
    iterations..............................................................: 1734   56.9062/s
    vus.....................................................................: 30     min=30        max=30
    vus_max.................................................................: 30     min=30        max=30

    NETWORK
    data_received...........................................................: 11 MB  348 kB/s
    data_sent...............................................................: 225 kB 7.4 kB/s



running (0m30.5s), 00/30 VUs, 1734 complete and 0 interrupted iterations
default ✓ [ 100% ] 30 VUs  30s