src/logs/api/test-api-prediction-bets-20250731-142718.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/api/test-api-prediction-bets.ts
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 481 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 1025 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 1603 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 2134 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 2732 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 3309 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 3911 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 4466 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 5006 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 5386 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......................: 5398    538.916081/s
    checks_succeeded...................: 100.00% 5398 out of 5398
    checks_failed......................: 0.00%   0 out of 5398

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=17.05ms min=5.26ms med=14.37ms max=112.55ms p(90)=23.87ms p(95)=31.78ms
      { expected_response:true }............................................: avg=17.05ms min=5.26ms med=14.37ms max=112.55ms p(90)=23.87ms p(95)=31.78ms
    http_req_failed.........................................................: 0.00%  0 out of 5398
    http_reqs...............................................................: 5398   538.916081/s

    EXECUTION
    iteration_duration......................................................: avg=18.51ms min=6.26ms med=15ms    max=146.19ms p(90)=26.77ms p(95)=37.47ms
    iterations..............................................................: 5398   538.916081/s
    vus.....................................................................: 10     min=10        max=10
    vus_max.................................................................: 10     min=10        max=10

    NETWORK
    data_received...........................................................: 38 MB  3.8 MB/s
    data_sent...............................................................: 691 kB 69 kB/s



running (10.0s), 00/10 VUs, 5398 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s