src/logs/api/test-api-prediction-markets-20250801-134734.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/api/test-api-prediction-markets.ts
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 65 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 157 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 256 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 341 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 420 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 511 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 600 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 682 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 765 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 847 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s


  █ TOTAL RESULTS 

    checks_total.......................: 857     84.751147/s
    checks_succeeded...................: 100.00% 857 out of 857
    checks_failed......................: 0.00%   0 out of 857

    ✓ status is 200

    HTTP
    http_req_duration.......................................................: avg=113.95ms min=13.49ms med=103.2ms  max=364.54ms p(90)=199.09ms p(95)=210.14ms
      { expected_response:true }............................................: avg=113.95ms min=13.49ms med=103.2ms  max=364.54ms p(90)=199.09ms p(95)=210.14ms
    http_req_failed.........................................................: 0.00%  0 out of 857
    http_reqs...............................................................: 857    84.751147/s

    EXECUTION
    iteration_duration......................................................: avg=117.23ms min=14.01ms med=103.74ms max=536.23ms p(90)=201.74ms p(95)=214.56ms
    iterations..............................................................: 857    84.751147/s
    vus.....................................................................: 10     min=10       max=10
    vus_max.................................................................: 10     min=10       max=10

    NETWORK
    data_received...........................................................: 24 MB  2.3 MB/s
    data_sent...............................................................: 112 kB 11 kB/s



running (10.1s), 00/10 VUs, 857 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s